EDT/МПСтриж/src/InformationRegisters/МассивАдресовДляОбменаСМП/МассивАдресовДляОбменаСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МассивАдресовДляОбменаСМП</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/МПСтриж/src/Documents/ЧекКПечати/ЧекКПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекКПечати</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧекаНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗаказа</name>
    <type>
      <types>DocumentRef.ДанныеЗаказаВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекАннулирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекПробитНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>КодНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Documents/ЧекКПечатиВозвратПрихода/ЧекКПечатиВозвратПрихода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекКПечатиВозвратПрихода</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресОтправкиЧека</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧекаНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗаказа</name>
    <type>
      <types>DocumentRef.ДанныеЗаказаВодителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекНапечатан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекКПечати</name>
    <type>
      <types>DocumentRef.ЧекКПечати</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>КодНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/МПСтриж/src/CommonModules/ОбменСКассовымСервером/Module.bsl
Функция НапечататьЧекНаСервере(ЧекКПечати, Регион, ТипЧекаДляОбработки) Экспорт
	ПараметрыОтвета = Новый Структура;
	
	ИдУзла = Константы.ИдентификаторТелефона.Получить();
	
	ИмяПользователя = Регион.ксИмяПользователя;
	ПарольПользователя = Регион.ксПарольПользователя;
	
	МассивАдресов = ПолучитьМассивАдресовСервераККМ(Регион);
	
	СоединениеУстановлено = Ложь;
	ОписаниеПроблемы = "";
	Для Каждого Тек Из МассивАдресов Цикл
		Попытка
			Определение = Новый WSОпределения(Тек, ИмяПользователя, ПарольПользователя,,10);
			Прокси = Новый WSПрокси(Определение, "http://www.strizh.org/exchange_ma", "ExchangeMA", "ExchangeMASoap");
			СоединениеУстановлено = Истина;
			Прервать;
		Исключение
			ОписаниеПроблемы = ОписаниеОшибки();
			//ОбщегоНазначения.ЗаписатьОшибкуВЛог(ОписаниеПроблемы);
			Продолжить;
		КонецПопытки;
	КонецЦикла;	
	
	
	
	Если Не СоединениеУстановлено Тогда
		ПараметрыОтвета.Вставить("ЧекОтправлен", Ложь);
		ПараметрыОтвета.Вставить("Ошибка", ОписаниеПроблемы);
		Возврат ПараметрыОтвета;
	КонецеСли;
	
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль = ПарольПользователя;
	
	
	Попытка
		
		Фабрика = Прокси.ФабрикаXDTO;
		ЧекТип = Фабрика.Пакеты.Получить("http://www.strizh.org/exchange_ma").Получить("checkForOrder");
		СтрокаЧекаТип = Фабрика.Пакеты.Получить("http://www.strizh.org/exchange_ma").Получить("orderRow");
		СтрокиЧекаТип = Фабрика.Пакеты.Получить("http://www.strizh.org/exchange_ma").Получить("orderRows");
		
		Если ТипЧекаДляОбработки = 1 Тогда
			Зап = Новый Запрос;
			Зап.Текст = "ВЫБРАТЬ
			            |	ЧекКПечати.ДанныеЗаказа.Реализация.Номер КАК order,
			            |	ЧекКПечати.ТипОплаты.Код КАК payType,
			            |	ЧекКПечати.ДанныеЗаказа.СуммаДоставка КАК deliveryPrice,
			            |	ЧекКПечати.ДанныеЗаказа.Реализация.СтавкаНДСФЗПоДоставке КАК deliveryNDS,
			            |	ЧекКПечати.ДанныеЗаказа.Реализация.ИдентификаторРейса КАК tripId,
			            |	ЧекКПечати.АдресОтправкиЧека КАК informAddress,
			            |	ЧекКПечати.СуммаПредоплаты КАК prepaymentAmount,
			            |	1 КАК checkType,
			            |	"""" КАК idCheckForReturn,
			            |	ВЫБОР
			            |		КОГДА ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
			            |				ИЛИ ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.ОплаченоВМагазине)
			            |			ТОГДА ЧекКПечати.ДанныеЗаказа.Реализация.КодОрганизацииНаличнойОплаты
			            |		КОГДА ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.СБП)
			            |			ТОГДА ЧекКПечати.ДанныеЗаказа.Реализация.КодОрганизацииОплатыПоСБП
			            |		ИНАЧЕ ЧекКПечати.ДанныеЗаказа.Реализация.КодОрганизацииОплатыПоТерминалу
			            |	КОНЕЦ КАК organizationCode,
			            |	ЧекКПечати.Товары.(
			            |		Номенклатура.Код КАК goodCode,
			            |		Количество КАК count,
			            |		Цена КАК price,
			            |		КодМаркировки КАК markingCode,
			            |		ЕСТЬNULL(ЧекКПечати.Товары.ПоставщикТовара.Код, """") КАК goodsSellerCode,
			            |		ВЫБОР
			            |			КОГДА ЧекКПечати.ДанныеЗаказа.Реализация.Партнер <> ЗНАЧЕНИЕ(Справочник.интернетМагазины.пустаяСсылка)
			            |				ТОГДА ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН
			            |			ИНАЧЕ ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН
			            |		КОНЕЦ КАК goodsSellerINN,
			            |		СтавкаНДС КАК NDS,
			            |		ПризнакПредметаРасчета КАК signSubjectCalc
			            |	) КАК Товары,
			            |	ЧекКПечати.ДанныеЗаказа.Реализация.НомерКлиента КАК orderIdImport,
			            |	ВЫБОР
			            |		КОГДА ЧекКПечати.ДанныеЗаказа.Реализация.Партнер <> ЗНАЧЕНИЕ(Справочник.интернетМагазины.пустаяСсылка)
			            |			ТОГДА ЧекКПечати.ДанныеЗаказа.Реализация.Партнер.ИНН
			            |		ИНАЧЕ ЧекКПечати.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН
			            |	КОНЕЦ КАК INNDeliverySeller
			            |ИЗ
			            |	Документ.ЧекКПечати КАК ЧекКПечати
			            |ГДЕ
			            |	ЧекКПечати.Ссылка = &Чек";
			Зап.УстановитьПараметр("Чек", ЧекКПечати);
		ИначеЕсли ТипЧекаДляОбработки = 2 Тогда 
			Зап = Новый Запрос;
			Зап.Текст = "ВЫБРАТЬ
			            |	ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.Номер КАК order,
			            |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты.Код КАК payType,
			            |	ЧекКПечатиВозвратПрихода.ДанныеЗаказа.СуммаДоставка КАК deliveryPrice,
			            |	ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.СтавкаНДСФЗПоДоставке КАК deliveryNDS,
			            |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ДанныеЗаказа.Реализация.ИдентификаторРейса КАК tripId,
			            |	ЧекКПечатиВозвратПрихода.АдресОтправкиЧека КАК informAddress,
						|	ЧекКПечатиВозвратПрихода.ЧекКПечати.СуммаПредоплаты КАК prepaymentAmount,						
			            |	2 КАК checkType,
			            |	ВЫБОР
			            |		КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
			            |				ИЛИ ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.ОплаченоВМагазине)
			            |			ТОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.КодОрганизацииНаличнойОплаты
			            |		КОГДА ЧекКПечатиВозвратПрихода.ЧекКПечати.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.СБП)
			            |			ТОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.КодОрганизацииОплатыПоСБП
			            |		ИНАЧЕ ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.КодОрганизацииОплатыПоТерминалу
			            |	КОНЕЦ КАК organizationCode,
			            |	ЧекКПечатиВозвратПрихода.ЧекКПечати.ИдентификаторЧекаНаСервере КАК idCheckForReturn,
			            |	ЧекКПечатиВозвратПрихода.ЧекКПечати.Товары.(
			            |		Номенклатура.Код КАК goodCode,
			            |		Количество КАК count,
			            |		Цена КАК price,
			            |		КодМаркировки КАК markingCode,
			            |		ЕСТЬNULL(ПоставщикТовара.Код, """") КАК goodsSellerCode,
			            |		ВЫБОР
			            |			КОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.Партнер <> ЗНАЧЕНИЕ(Справочник.интернетМагазины.пустаяСсылка)
			            |				ТОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.Партнер.ИНН
			            |			ИНАЧЕ ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН
			            |		КОНЕЦ КАК goodsSellerINN,
			            |		СтавкаНДС КАК NDS,
						|		ПризнакПредметаРасчета КАК signSubjectCalc
			            |	) КАК Товары,
			            |	ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.НомерКлиента КАК orderIdImport,
			            |	ВЫБОР
			            |		КОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.Партнер <> ЗНАЧЕНИЕ(Справочник.интернетМагазины.пустаяСсылка)
			            |			ТОГДА ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.Партнер.ИНН
			            |		ИНАЧЕ ЧекКПечатиВозвратПрихода.ДанныеЗаказа.Реализация.ИнтернетМагазин.ИНН
			            |	КОНЕЦ КАК INNDeliverySeller
			            |ИЗ
			            |	Документ.ЧекКПечатиВозвратПрихода КАК ЧекКПечатиВозвратПрихода
			            |ГДЕ
			            |	ЧекКПечатиВозвратПрихода.Ссылка = &Чек";
			Зап.УстановитьПараметр("Чек", ЧекКПечати);
		КонецеСли;
		
		Выб = Зап.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			ЧекКС = Фабрика.Создать(ЧекТип);
			СтрокиЧека = Фабрика.Создать(СтрокиЧекаТип);
			
			ЗаполнитьЗначенияСвойств(ЧекКС, Выб);
			ВыбТов = Выб.Товары.Выбрать();
			Пока ВыбТов.Следующий() Цикл
				СтрокаЧека = Фабрика.Создать(СтрокаЧекаТип);
				ЗаполнитьЗначенияСвойств(СтрокаЧека, ВыбТов);
				СтрокиЧека.orderRow.Добавить(СтрокаЧека);
			КонецЦикла;	
			ЧекКС.orderRows = СтрокиЧека;
			
			
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			Фабрика.ЗаписатьXML(ЗаписьXML, ЧекКС);
			Результат = ЗаписьXML.Закрыть();	
			
			
			Хр = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
			
			
			ОтветКС = Прокси.registerCheck(Хр, ИдУзла);
			Если ОтветКС.isError Тогда
				ПараметрыОтвета.Вставить("ЧекОтправлен", Ложь);
				ПараметрыОтвета.Вставить("Ошибка", ОтветКС.error);
			Иначе
				ПараметрыОтвета.Вставить("ЧекОтправлен", Истина);
				ПараметрыОтвета.Вставить("Ошибка", "");
				ПараметрыОтвета.Вставить("ИдЧека", ОтветКС.idCheck);
			КонецеСли;	
			
			Возврат ПараметрыОтвета;
		КонецЕсли;	
	Исключение
		ОписаниеПроблемы = ОписаниеОшибки();
		ПараметрыОтвета.Вставить("ЧекОтправлен", Ложь);
		ПараметрыОтвета.Вставить("Ошибка", ОписаниеПроблемы);
		
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(ОписаниеПроблемы);
		Возврат ПараметрыОтвета;
	КонецПопытки;
КонецФункции

Функция ЗапроситьДанныеЧека(ИдентификаторЧека, Регион) Экспорт
	ПараметрыОтвета = Новый Структура;
	
	ИдУзла = Константы.ИдентификаторТелефона.Получить();
	
	ИмяПользователя = Регион.ксИмяПользователя;
	ПарольПользователя = Регион.ксПарольПользователя;
	
	МассивАдресов = ПолучитьМассивАдресовСервераККМ(Регион);
	
	СоединениеУстановлено = Ложь;
	ОписаниеПроблемы = "";
	Для Каждого Тек Из МассивАдресов Цикл
		Попытка
			Определение = Новый WSОпределения(Тек, ИмяПользователя, ПарольПользователя,,10);
			Прокси = Новый WSПрокси(Определение, "http://www.strizh.org/exchange_ma", "ExchangeMA", "ExchangeMASoap");
			СоединениеУстановлено = Истина;
			Прервать;
		Исключение
			ОписаниеПроблемы = ОписаниеОшибки();
			Продолжить;
		КонецПопытки;
	КонецЦикла;	
	
	
	
	Если Не СоединениеУстановлено Тогда
		ПараметрыОтвета.Вставить("ЧекОтправлен", Ложь);
		ПараметрыОтвета.Вставить("ЕстьОшибка", Истина);

		ПараметрыОтвета.Вставить("Ошибка", ОписаниеПроблемы);
		Возврат ПараметрыОтвета;
	КонецеСли;
	
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль = ПарольПользователя;
	
	
	/////////////////////
	
	Попытка
		ОтветКС = Прокси.getCheckParameters(ИдентификаторЧека);
		
		Зап = ОтветКС.Получить();
		Чт = Новый ЧтениеXML();
		Чт.УстановитьСтроку(Зап);
		ПараметрыЧекаТип = Прокси.ФабрикаXDTO.Пакеты.Получить("http://www.strizh.org/exchange_ma").Получить("getCheckParameters");
		ОтветКС = Прокси.ФабрикаXDTO.ПрочитатьXML(Чт, ПараметрыЧекаТип);
		
		
		ПараметрыОтвета.Вставить("ЕстьОшибка", Ложь);
		ПараметрыОтвета = ОбщегоНазначения.ВернутьСтруктуруПоXDTO(ОтветКС, ПараметрыОтвета);
		Возврат ПараметрыОтвета;
	Исключение
		ТекстПроблемы = ОписаниеОшибки();
		ПараметрыОтвета.Вставить("ЕстьОшибка", Истина);
		ПараметрыОтвета.Вставить("Ошибка", ТекстПроблемы);
		ОбщегоНазначения.ЗаписатьОшибкуВЛог(ТекстПроблемы);
		
		Зап = ОтветКС.Получить();
		Чт = Новый ЧтениеXML();
		Чт.УстановитьСтроку(Зап);
		ПараметрыЧекаТип = Прокси.ФабрикаXDTO.Пакеты.Получить("http://www.strizh.org/exchange_ma").Получить("getCheckParameters");
		ОтветКС = Прокси.ФабрикаXDTO.ПрочитатьXML(Чт, ПараметрыЧекаТип);
		
        ПараметрыОтвета = ОбщегоНазначения.ВернутьСтруктуруПоXDTO(ОтветКС, ПараметрыОтвета);
		Возврат ПараметрыОтвета;
	КонецПопытки;
КонецФункции	

Функция ПолучитьМассивАдресовСервераККМ(Регион)
	СтрокаАдреса = Регион.ксАдресСервера;
	
	МассивАдресов = Новый Массив;
	
	Если Не Константы.ТестоваяСреда.Получить() Тогда
		Если Найти(СтрокаАдреса, "АдресСервера") Тогда
			Зап = Новый Запрос;
			Зап.Текст = "ВЫБРАТЬ
			|	МассивАдресовДляОбменаСМП.Адрес КАК Адрес
			|ИЗ
			|	РегистрСведений.МассивАдресовДляОбменаСМП КАК МассивАдресовДляОбменаСМП
			|ГДЕ
			|	МассивАдресовДляОбменаСМП.Терминал = &Терминал
			|
			|УПОРЯДОЧИТЬ ПО
			|	МассивАдресовДляОбменаСМП.Приоритет";
			Зап.УстановитьПараметр("Терминал", Регион.Ссылка);
			
			Выб = Зап.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				МассивАдресов.Добавить(СтрЗаменить(СтрокаАдреса, "АдресСервера", Выб.Адрес));
			КонецЦикла;	
		Иначе	
			МассивАдресов.Добавить(СтрокаАдреса);
		КонецеСли;	
	Иначе
		МассивАдресов.Добавить("http://192.168.5.104/cash_server_on_lem/ws/ExchangeMA.1cws?wsdl");
	КонецеСли;
	Возврат МассивАдресов;
КонецФункции
